
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 5 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T13:25:22Z" -> (known after apply) # forces replacement
      ~ id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-DATABASE/7a734a9430384d5e89e7fb31f1149ba9" -> (known after apply)
        name                    = "api-POSTGRES-FLEXIBLE-DATABASE"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-DATABASE/versions/7a734a9430384d5e89e7fb31f1149ba9" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-DATABASE" -> (known after apply)
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
      ~ version                 = "7a734a9430384d5e89e7fb31f1149ba9" -> (known after apply)
      ~ versionless_id          = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-DATABASE" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T13:25:22Z" -> (known after apply) # forces replacement
      ~ id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-HOST/0d328fc5e06d491bb81637e36bd1db2e" -> (known after apply)
        name                    = "api-POSTGRES-FLEXIBLE-HOST"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-HOST/versions/0d328fc5e06d491bb81637e36bd1db2e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-HOST" -> (known after apply)
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
      ~ version                 = "0d328fc5e06d491bb81637e36bd1db2e" -> (known after apply)
      ~ versionless_id          = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-HOST" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T13:25:22Z" -> (known after apply) # forces replacement
      ~ id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PASS/bc00cc5025ec4b44a694fba226f4b866" -> (known after apply)
        name                    = "api-POSTGRES-FLEXIBLE-PASS"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-PASS/versions/bc00cc5025ec4b44a694fba226f4b866" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-PASS" -> (known after apply)
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
      ~ version                 = "bc00cc5025ec4b44a694fba226f4b866" -> (known after apply)
      ~ versionless_id          = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PASS" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T13:25:22Z" -> (known after apply) # forces replacement
      ~ id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PORT/065310f686644ab9ac768f6f97bb6b59" -> (known after apply)
        name                    = "api-POSTGRES-FLEXIBLE-PORT"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-PORT/versions/065310f686644ab9ac768f6f97bb6b59" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-PORT" -> (known after apply)
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
      ~ version                 = "065310f686644ab9ac768f6f97bb6b59" -> (known after apply)
      ~ versionless_id          = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PORT" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T13:25:22Z" -> (known after apply) # forces replacement
      ~ id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-USER/8b501afce82c4f7dbd4c7a95bcab3a94" -> (known after apply)
        name                    = "api-POSTGRES-FLEXIBLE-USER"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-USER/versions/8b501afce82c4f7dbd4c7a95bcab3a94" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-aat/providers/Microsoft.KeyVault/vaults/rpts-aat/secrets/api-POSTGRES-FLEXIBLE-USER" -> (known after apply)
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
      ~ version                 = "8b501afce82c4f7dbd4c7a95bcab3a94" -> (known after apply)
      ~ versionless_id          = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-USER" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":231,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->